Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings.GetAdvancedOption Method (String, String)
 Returns the value of an advanced option variable.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool GetAdvancedOption(
	string VariableName,
	ref string Value
)
Public Shared Function GetAdvancedOption (
	VariableName As String,
	ByRef Value As String
) As Boolean
Parameters
VariableName
Type: System.String
The name of the advanced option.
Value
Type: System.String
The returned value of the advanced option.
Return Value
Type: Boolean
True if the value was successfully retrieved.
See Also
Reference
TeklaStructuresSettings Class
GetAdvancedOption Overload
Tekla.Structures Namespace